package main.java.com.ohgiraffers.understand;

import java.util.ArrayList;
import java.util.Iterator;



class Words{
    ArrayList al = new ArrayList();
    String[] word = {
            "나무","콘크리트","배열","개","고양이","건물","하늘","색깔","동물","개구리","뛰다","날다","걷다","철","구리","은","금","석탄","보일러","연탄",
            "벼락","구름","경찰","소방관","준법정신","법","문화","제도","과자","대기업","뫼비우스","하이젠베르크","독수리","반지","체인","탱크","요요","구급차","아이디","패스워드",
            "중소기업","IT","전자","스마트폰","거울","액자","블랙홀","영국","북한","셰일가스","천연가스","핵","우라늄","지하벙커","미사일","원자","분자","전자기학","원심력","원심분리기",
            "대통령","정부기관","공기업","사원증","줄","칼","가위","풀","본드","접착제","인터넷","구글","네이버","웹툰","바보","사기","왼손잡이","나무","생장","유기물","무기물",
            "맨틀","지각","비행기","하늘","재벌","산유국","광구","광산","빙하","남극","북극","건전지","자석","인력","척력","뉴턴","사과","주식","정치","음모","케찹","마요네즈",
            "아지트","지하","옥탑방","까페","커피","스탠드","전구","회오리감자","콘센트","곱창","솜사탕","주전자","커피머신","돈부리","마카롱","과제","카라멜","버터","오징어","바다",
            "생선","나비","알","구멍","개미지옥","개미","오이디푸스","축구","공","야구","농구","배구","수박","박수","참외","오이","휴지통","재활용","생선","계란","썩다","틀니","치아",
            "건반","피아노","빗자루","수첩","트럼펫","이쑤시개","아궁이","이불","베개","벼","볏짚","보리","게장","양념","치킨","날개","깃털","거위","오리","봄","여름","가을","겨울",
            "허수아비","비닐장갑","낙엽","눈","태풍","초가집","뼈","관","근육","허벅지","무릎","발가락","머리카락","메두사","뱀","황소","창고","들개","동고서적","피카츄","바람",
            "제주도","여자","남자","돋보기","만보기","알람시계","어플","빈대떡","부산","어묵","호떡","호빵","오븐","전자렌지","수도꼭지","세탁기","건조대","빨래","동대문",
            "화장실","하수구","배설물","로마","길","힙합","모자","악취","금발","유전자","여드름","속눈썹","쌍커풀","햄스터","도마뱀","장판","보일러","호두","인형","식칼","양파",
            "멸치","선박","잠수부","잠수선","어뢰","폭발","카드","용","문어","김","그네","회전초밥","시소","별","달","태양","점성술","사주","떡볶이","피자","파스타","빙수","미술",
            "음악","마약","연습생","고리대금","경제","회계","JAVA","프로그램","노트북","데스크탑","박스","휴지","화폐","동전","바셀린","연필","노트","책","권력","플라스틱","유리",
            "그릇","요리","LED","귤","향수","마우스","비닐봉지","키보드","블라인드","창문","방충망","행거","코트","셔츠","스키니","양말","잠","침대","책상","아이콘","USB","오리",
            "삼베","할아버지","체리","파이","콜라","김치","울타리","족쇄","염통","공유기","이어폰","서랍장","통나무","체중계","레이저","다관","도자기","꽃병","테이프","전깃줄","해돋이",
            "스위치","솜","설탕","아이스크림","파일","목욕","변기","돼지","확인","일본","사또","버선","구슬","미역국","용왕","메기","멧돼지","미끄럼틀","모래","성","성당","기부",
            "라디오","라디에이터","리모콘","탁자","사마귀","우물","두레박","황산","어린이","풍선","실","바늘","손톱","털","복숭아","원숭이","염라대왕","관세음보살","불교","기독교","천주교",
            "이슬람교","아랍","중동","이스라엘","사막","기마병","갑옷","피리","후추","소금","밀가루","메밀","쌀가루","숭늉","신선","용접","알콜","빨대","수능","체벌","참치","치약",
            "약국","국보","병원","보물","약","의사","환자","시한부","마감","재봉틀","질소","장교","위산","산성","염기성","당구","의지","포기","도전","석양","우주","은하","은하수",
            "위성","혜성","착륙","로봇","공장","자동차","우유","스텔스","밝다","아름답다","빛나다","어둡다","따뜻한","차가운","미지근한","불안한","활기찬","역동적인","수동적인",
            "전쟁","다투다","싸움","논공행상","재배","양육","육아","출산","저출산","자동화","능동적인","의자","깃털","수평선","지평선","원","삼각형","사각형","육각형","보석",
            "양적완화","신문","배달","음식","옷걸이","경마","토토","로또","시베리아기단","오호츠크기단","고조선","조선","고려","신라","백제","고구려","발해","부여","활","칼","창","방패",
            "죽염","지퍼","단추","가방","콴시","중국","위안화","달러","엔화","원화","은행","한국인","냄비","뚝배기","포도","뜰채","장어","강","수영","백사장","유흥","소설","추리","수필",
            "연애","기념일","빼빼로","노가다","법률가","교수","선생님","여자","남자","선입견","색안경","색연필","백짓장","캔버스","대학","도서관","대여","컴퓨터","다운로드","캐나다",
            "유학","여행","어학","습관","계보","계열","할복","당동벌이","분파","이순신","거북선","태종","세종대왕","이성계","이승만","박정희","건국","하와이","임시정부","천재",
            "노력","땀","재개","일시정지","토렌트","원순철","광고","홍보","방문","빚","어려운","쉬운","재밌는","지루한","반복","새롭다","칠판","화이트보드","보드마카","시간",
            "영화","표","예매","예약","대기","순번","텐트","두껍다","얇다","스판","선정적","투명하다","탁하다","막걸리","소주","맥주","발효","위스키","양주","젓가락","숟가락",
            "오른손","밤","저녁","교복","선도부","사랑","아이폰","중고","소프트웨어","하드웨어","동대문구","성동구","강남","강북","남산타워","정상","산","불꽃놀이","화려한","소박한",
            "담요","모포","군장","침낭","단어장","여운","미련","아쉬움","족보","조상","하느님","애국가","북","장구","꾕가리","풍물놀이","녹","꽃다발","자장면","춘장","단무지","고냉지",
            "조랑말","적토마","세포","액포","가면","하훼탈","장작","악어","하마","코뿔소","여우","늑대","호랑이","다람쥐","박쥐","정수기","선반","청소기","도토리","프리셀","파렛트",
            "오일","색소","먹","화선지","운전","핸들","브레이크","엑셀","책장","서재","두루마기","Youtube","비밀","불명","톱","쳇바퀴","오두막","노예","흑인","백인","황인","시간표","총",
            "레몬","비타민","철분","화장","화장품","수분","걸레","변화","양치","컵","스테인글라스","패스트푸드","튀김","침","괴물","배설물","코끼리","종","크리스마스","새해","레이스",
            "병풍","제방","방파제","쓰나미","보복","보안","해킹","전문가","초보자","강의","사무라이","임진왜란","병자호란","환향녀","카카오톡","전화","문자","데이터","무료","통신",
            "저가","고가","음향","사이트","매매","장터","국밥","비석","조각","외제차","계단","인셉션","화분","공사장","인테리어","보색","보호색","카멜레온","갈증","스카프","목도리",
            "목폴라","울","면","모공","건조","습도","적도","렌즈","카메라","흡수","배출","청바지","가디건","조끼","패딩","푸아그라","상어","알","북어","택배","업로드","타자","속도","대박",
            "지구"," 수성"," 담즙","화나다","스핑크스"," 전갈","납치"," 고구마"," 신선하다","게임","한글","정글","정","사자","얼룩말","클럽","바텀","너클","엄마","아버지","질문","OS",
            "색다른","비","하품","바둑","오목","체스","돌맹이","트롤","스미골","슬라임","좀비","컴퍼스","거물","압정","시계침","시추","매장","자","파운데이션","비비크림","도시설계",
            "엑스레이"," 국화","동양화"," 부채","경영","시각","공간디자인","상추","뇌","시넵스","영혼","형법","헌법","민법","형사소송법","아줌마","피자","햄버거","베이컨","위","간","폐",
            "대장","쇄골","고용노동법","무지개","주름","해골","첫사랑","스프링","버터","생크림","어금니","치악력","충성심","휠체어","지팡이","도라지","디스코","놀이기구","럭비",
            "스타크래프트","피파온라인3","넥슨","마비노기","마루","꽃가마","낙타","공룡","자물쇠","금고","마트","우라노스","목성","토성","우주선","왕복","기차","플랫폼","텍시","버스",
            "파카","인종차별","헬멧","모자","후드","손톱","발톱","바퀴","새우","화강암","현무암","해녀","잔소리","해물","조개","동굴","해저","심해어","붕소","나트륨","라면","선식","포카칩",
            "염색체","역할","민물고기","성경","코란","국어","역사","한자","일어","중국어","영어","샹들리에","전화벨","편서풍","아프리카","무역풍","스페이스 바"," 극세사","해류","서핑",
            "전기차","스마트가구","노량진","보름달","초승달","겨자","넙치","회","멍","달팽이관","여왕","왕","나사","연어","볼트","회전","드라이버","망치","스페너","스크류바","얼음",
            "냉수","산타","루돌프","아이스링크","피겨","조심하다","넘어지다","안장","마굿간","비구니","바구니","개미햝기","슬리퍼","온수","샤워","피드백","컨펌","흔들의자","픽셀",
            "쵸크","게슈탈트","도화지","한지","문지방","문턱","문고리","싱크홀","호수","현상","인디언","히스페닉","갱","마약상","마케팅","커뮤니케이션","초등학생","중학생","고등학생",
            "자유","평등","서버","등업","패치","재채기","유머","직업","채도","픽토그램","명도","레이어","틀","붙여넣기","잘라내기","스캔","복사","프린트","3D","만화","오타쿠","피규어",
            "말년병장","의전","브라운","검정색","평전","나폴레옹","서양","동양","철학","영문법","주식","보험","세일즈","학습법","헬스","P.T","콘서트","핸드백","독재자","포스트잇",
            "안드로이드","모바일","기초","비례","고흐","피카소","이중섭","병아리","놀이방"
    };
    void start(){
        for (int i = 0; i< 10000; i++){
            int index = (int)(Math.random()*1000);
            String temp = "없음";
            temp = word[index];
            word[index] = word[0];
            word[0] = temp;
        }
        for(int i = 0; al.size()<3; i++){
            al.add(word[i]);
        }
    }
    void print(){
        Iterator iter = al.iterator();
        while(iter.hasNext()){
            System.out.println(iter.next());
        }
    }
}

public class Application01 {
    public static void main(String[] args){
        Words words = new Words();
        words.start();
        words.print();
    }
}